stanfordBunny/OpenFOAM/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

wallCondition
{
    type        alphatWallFunction;
    value       $internalField;
}


inletCondition  { type zeroGradient; }
outletCondition { type zeroGradient; }


#include        "boundaryFieldTurbulence"

// ************************************************************************* //
