stanfordBunny/OpenFOAM/0/boundaryFieldTurbulence
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "boundaryField specialization for turbulence quantities";
    object      boundaryFieldTurb;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// inlets are type 'patch' - cannot use wall functions

#include        "boundaryField"
boundaryField
{
    "inlet.*" { $noCondition; }
}

// ************************************************************************* //
