stanfordBunny/OpenFOAM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "$FOAM_CASE/boundaryConditions"
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1;

inletCondition
{
    type        turbulentIntensityKineticEnergyInlet;
    intensity   $intensity;
    value       $internalField;
}

wallCondition
{
    type        compressible::kqRWallFunction;
    value       uniform 0;
}


#include        "boundaryFieldTurbulence"

// ************************************************************************* //
